/*
 Navicat Premium Data Transfer

 Source Server         : 2333
 Source Server Type    : MySQL
 Source Server Version : 80028 (8.0.28)
 Source Host           : localhost:3306
 Source Schema         : qqbot

 Target Server Type    : MySQL
 Target Server Version : 80028 (8.0.28)
 File Encoding         : 65001

 Date: 04/11/2023 08:46:29
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for auto_sign
-- ----------------------------
DROP TABLE IF EXISTS `auto_sign`;
CREATE TABLE `auto_sign`  (
  `sign_name` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL,
  `sign_cookie` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL,
  `formhash` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of auto_sign
-- ----------------------------

-- ----------------------------
-- Table structure for black_list
-- ----------------------------
DROP TABLE IF EXISTS `black_list`;
CREATE TABLE `black_list`  (
  `qq_group` bigint NOT NULL,
  `qq` bigint NULL DEFAULT NULL
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '黑名单表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of black_list
-- ----------------------------

-- ----------------------------
-- Table structure for chat_list
-- ----------------------------
DROP TABLE IF EXISTS `chat_list`;
CREATE TABLE `chat_list`  (
  `question` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '问题',
  `answer` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL COMMENT '回答',
  `is_change` tinyint NULL DEFAULT 1 COMMENT '是否能添加（1：能，0：不能）'
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '菜单表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of chat_list
-- ----------------------------
INSERT INTO `chat_list` VALUES ('菜单', '—————菜单—————\r\n☀️.日常功能     🔍.聊天功能\r\n🏦.银行功能     🔑.卡密功能\r\n✨.会员功能     🎤.点歌功能\r\n🚟.排行系统     🐟.摸鱼功能 \r\n👊.群管功能     Ⓜ️.M C 功能\r\n🧹.杂项功能     💨.运行状态 \r\n\r\nps：前面带点要加点！！\r\n\'.\'可以换成\'！\' \'!\' \'#\'\r\n————————————', 1);
INSERT INTO `chat_list` VALUES ('日常功能', '————日常功能————\r\n🏷️签到    🤏戳我     📑抽签 \r\n💰钱包    📜积分     🪙充值\r\n🤐禁言抽奖      😍来份涩图\r\n😴大家晚安\r\n🥰嘤嘤嘤💫你好🌦️XX天气  \r\n————————————', 1);
INSERT INTO `chat_list` VALUES ('聊天功能', '————聊天功能————\r\n@蜜桃酱 发送你要问的信息\r\n例如：\r\n@蜜桃酱 你是谁\r\n————————————', 1);
INSERT INTO `chat_list` VALUES ('银行功能', '————银行功能————\r\n🗄️存款    🏧取款    💈转账\r\n\r\n💰银行余额     🤑领取利息\r\n\r\n例如：\r\n存(取)款100\r\n转账@蜜桃酱 100\r\n————————————', 1);
INSERT INTO `chat_list` VALUES ('卡密功能', '————卡密功能————\r\n卡密充值[你的卡密]\r\n例如：卡密充值114514\r\n————————————', 1);
INSERT INTO `chat_list` VALUES ('会员功能', '————会员功能————\r\n💸购买会员[X个月(年)]\r\n🗓️会员到期时间\r\n\r\n例如：购买会员3个月\r\n————————————', 1);
INSERT INTO `chat_list` VALUES ('排行系统', '————排行系统————\r\n💰财富排行榜\r\n🔥连签排行榜\r\n🗓️签到排行榜\r\n💦活跃排行榜\r\n🏮会员排行榜\r\n————————————', 1);
INSERT INTO `chat_list` VALUES ('点歌功能', '————点歌功能————\r\n💿网易云点歌\r\n📀酷我点歌\r\n\r\n例如:\r\n酷我(网易云)点歌XXX\r\nps：酷我支持多选\r\n每次点歌需要消耗100蜜桃币\r\n————————————', 1);
INSERT INTO `chat_list` VALUES ('摸鱼功能', '————摸鱼功能————\r\n🦈摸鱼X次\r\n🍥摸鱼记录\r\n🎣摸鱼排行榜\r\n🛎️领取摸鱼成就\r\n\r\n例如:\r\n摸鱼10次\r\nps：鱼多可获得成就\r\n每次摸鱼需要消耗200蜜桃币\r\n————————————', 1);
INSERT INTO `chat_list` VALUES ('群管功能', '————群管功能————\r\n🤐[解除]禁言\r\n❌撤回\r\n\r\n*开启(关闭)全员禁言\r\n*添加(删除)管理员\r\n*更新成员列表\r\n*[解除]拉黑\r\n*踢黑\r\n例如:\r\n禁言@蜜桃酱 1天2小时3分钟\r\n左滑消息输入\'撤回\'发送即可\r\n————————————', 1);
INSERT INTO `chat_list` VALUES ('MC功能', '————MC功能————\r\n👚皮肤获取[用户名]\r\n✉️/MotdBE\r\n🆔/id表[物品名]\r\n🗺️Minecraft\r\n🔍版本搜索[版本号]\r\n\r\n例如:\r\n皮肤获取 Steve\r\n/MotdBE 127.0.0.1:19132\r\n版本搜索1.14.514\r\nps：\r\n👚只能获取Java正版用户的皮肤\r\n✉️获取BE版本服务器信息\r\n🗺️获取MC版本下载链接\r\n————————————', 1);
INSERT INTO `chat_list` VALUES ('杂项功能', '—————杂项功能—————\r\n🧧发红包X个Y   ⚫获取黑白头像\r\n❤️查看对象     ⌨️(本周)上周词云\r\n💲支付宝到账X        🌸日语XXX\r\n🆓EPIC周免            😃emoji合成\r\n📇我的周年纪念卡片       🖋️一言\r\n🐶舔狗日记(图)           👀看图片\r\n\r\n例如:\r\n发红包10个1000\r\n支付宝到账100\r\n日语変態\r\nemoji合成😃+😁\r\n——————————————', 1);
INSERT INTO `chat_list` VALUES ('摸鱼排行榜', '————摸鱼排行榜————\r\n🐟咸鱼排行榜\r\n🐟大咸鱼排行榜\r\n🐟金色咸鱼排行榜\r\n🐟七彩大咸鱼排行榜\r\n————————————', 1);
INSERT INTO `chat_list` VALUES ('Minecraft', '基岩版(手机)：\r\n1.19.X：\r\nhttps://www.123pan.com/s/dhm9-O9N0A\r\n1.20.X:\r\nhttps://www.123pan.com/s/dhm9-gxO0A\r\n旧版本下载：\r\nhttps://mc233.endyun.ltd\r\nhttp://bbk.endyun.ltd\r\nAPP下载：\r\nhttps://www.123pan.com/s/dhm9-6bD0A.html\r\nMinecraft版本命名解释：\r\nhttps://docs.qq.com/doc/DY3RZaGhBQnphdlpI\r\n\r\nJava版启动器(电脑)：\r\nhttps://zihao-il.lanzouo.com/b0rwozud', 1);
INSERT INTO `chat_list` VALUES ('抽奖功能', '————抽奖功能————\r\n🏆发起抽奖 [标题] [中奖人数]人 [简介]\r\n➕参加[标题]抽奖\r\n✉️[标题]抽奖信息\r\n🎁[标题]开奖\r\n🧧[标题]中奖查询\r\n\r\n————————————', 1);

-- ----------------------------
-- Table structure for draw_lots
-- ----------------------------
DROP TABLE IF EXISTS `draw_lots`;
CREATE TABLE `draw_lots`  (
  `id` int NOT NULL COMMENT '签的id',
  `lot` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL COMMENT '抽签的内容',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of draw_lots
-- ----------------------------
INSERT INTO `draw_lots` VALUES (1, '上签\n锺离成道\n子宫\n开天辟地作良缘　吉日良时万物全　\n若得此签非小可　人行忠正帝王宣\n此卦盘古初开天地之象　诸事皆吉也\n急速兆速　年未值时　观音降笔　先报君知\n自身  秋冬大利　\n求财  秋冬大利　\n交易  成　\n婚姻  成　\n天开地辟。结良缘是天地开创之象。为大吉大利之象也。日吉时良。万事俱全顺遂之命。能蒙神指示为此签之人。非小可也。劝君必行中正帝王亦宣言曰。如能行之正直。积善。修身时。必能持之恒久。如宋太祖。赵匡胤之黄袍加身。急速非速言来时值观音降事报与君之者。');
INSERT INTO `draw_lots` VALUES (2, '中下签\n苏秦不第\n子宫\n鲸鱼未变守江河　不可升腾更望高　\n异日峥嵘身变化　许君一跃跳龙门\n此卦鲸鱼未变之象　凡事忍耐待时也\n得忍且忍　得耐且耐　须待时至　功名还在\n自身  还愿　\n求财  欠利　\n交易  \n婚姻  难　\n鲸鱼未化守江湖。姜太公之受难时也。为大鲸未变之象。凡事进退待时。不可轻举妄动。动则凶。静则吉。君尔也。得忍且忍。得耐且耐身不而托。功名自在者。来日峥嵘蜕身时。一跃可过禹门者');
INSERT INTO `draw_lots` VALUES (3, '下签\n董永遇仙\n子宫\n临风冒雨去还乡　正是其身似燕儿　\n衔得坭来欲作垒　到头垒坏复须坭\n此卦燕子衔坭之象　凡事劳心费力也\n千般用计　晨昏不停　谁知此事　到底劳心\n自身  谨防　\n求财  有　\n交易  成　\n婚姻  不合　\n冲风冒雨去还归。役役劳心似燕儿。君尔之运逢燕子衔泥筑巢之象耶。空心徒劳。无益者。为先难後甘之运。唯应小心。本签之总结也。千方百计。晨昏鹿鹿不停。谁知此事到底无以可成者。修之。悟之。');
INSERT INTO `draw_lots` VALUES (4, '上签\n玉莲会十朋\n子宫\n千年古镜复重圆　女再求夫男再婚　\n自此门庭重改换　更添福禄在儿孙\n此卦串镜重圆之象　凡事劳心有贵也\n淘沙成金　骑龙踏虎　虽是劳心　于中有补\n自身  秋冬旺　\n求财  秋冬旺　\n交易  允　\n婚姻  成　\n\n菱花镜破镜重圆。为破镜重圆之象。凡事成就吉者也。不是上上者。为中中之签。是先凶後吉之签。交易持公平。求财亦在秋冬转旺。如逢如此之中中运也。可积极为善。积德。当有转吉之机。');
INSERT INTO `draw_lots` VALUES (5, '中签\n刘晨遇仙\n丑宫\n一锥草地要求泉　努力求之得最难　\n无意俄然遇知己　相逢携手上青天\n此卦锥地求泉之象　凡事先难后易也\n欲望心事　西方可求　不如莫动　立地可谋\n自身  利　\n求财  利　\n交易  合　\n婚姻  合　\n一锄掘地妥求泉水。此象则表徵君之运图。是凡事谋略之後。劳心方有成就者也。努力向前必有化凶为吉之时。自励奋斗。偶然遇知己。彼时即是君尔。得贵人之刻。在伊人扶持下。必能上青天矣。');
INSERT INTO `draw_lots` VALUES (6, '中签\n仁贵遇主\n丑宫\n投身岩下　鸟居　须是还他大丈夫　\n及早营谋谁可得　通行天地此人无\n此卦投岩铜鸟之象　凡事宜顺吉之兆\n食用无鱼　身清喜贫　待时利乐　权与概人\n自身  中吉　\n求财  中吉　\n交易  难　\n婚姻  平平　\n於岩下饲於菟者。是凡事宜顺则吉之表徵也。得本签之君。应知。为人宜守旧。不可轻举妄动者也。不可贪求非份之外之财。或舍近图远者。皆避免之。予以君知者。使非常清身。岂贫待他时至祥。');
INSERT INTO `draw_lots` VALUES (7, '下签\n苏娘走难\n丑宫\n奔波阻隔重重险　带水拖坭去度山　\n更望他乡求用事　千乡万里未回还\n此卦拖坭带水之象　凡事守旧则吉也\n退身可得　进步为难　只宜守旧　莫望高扳\n自身  祈福　\n求财  秋冬吉　\n交易  平平　\n婚姻  祈福　\n奔波役役重重险。带水拖泥又渡山之运途也。凡事必须谨慎。准备酌理。探取根源。明其是非者。审一己之进退。方向者。心存恶者得祸。存直者即可为获福矣。祸福者皆由人作之。退身可得进步难为。只宜守田切莫高扳。');
INSERT INTO `draw_lots` VALUES (8, '上签\n姚能遇仙\n丑宫\n茂林松柏正兴旺　雨雪风霜总莫为　\n异日忽然成大用　功名成就栋梁材\n此卦此卦松柏茂林之象　凡事有贵气也\n路上亨通　终身有功　田蚕丰熟　家道兴隆\n自身  顺利　\n求财  中平　\n交易  旺　\n婚姻  成　\n本签为松怕之岁寒者。任何之树木枯之後。仍挺具秀者。各面均呈祥。当异口成大材老焉。是大器晚成型。惟不可因此满足。必须因此更加培植。事事积德。方可有更好之明日。要之。象徵平地风光风缘有定。丰稔。田稻家获余庆。');
INSERT INTO `draw_lots` VALUES (9, '上签\n孔明点将\n寅宫\n烦君勿作私心事　此意偏宜说问公　\n一片明心光皎洁　宛如皎月正天中\n此卦皎月当空之象　凡事光明通气也\n心中正直　理顺法宽　圣无私语　终有分明\n自身  顺　\n求财  中平　\n交易  旺　\n婚姻  成　\n本签者皎月当空之相也。凡事正直则吉之签。虽是前运不佳。前事去之後。渐见顺利者。君尔幸获此签之示者。平素之存心种德之所由成。後得如此之佳境。亦即是心中正直。理顺法宽天无私意莫空虚。');
INSERT INTO `draw_lots` VALUES (10, '中签\n庞涓观阵\n寅宫\n石藏无价玉和珍　只管他乡外客寻　\n宛如持灯更觅火　不如收拾枉劳心\n此卦持灯觅火之象　凡事待时成就也\n姻缘会遇　何事不成　须无限意　眼前是真\n自身  安　\n求财  难　\n交易  难　\n婚姻  合　\n本签者将灯不见火之相。凡事自就之表徵者。逢此下下之时。宜顶天拜地。始可得无灾。是谋望之不成。修吾身後。积德。布施。後必有回天之机。亦即是机缘若遇何事不成春无限前似真此者也。');
INSERT INTO `draw_lots` VALUES (11, '上签\n书荐姜维\n寅宫\n欲求胜事可非常　争奈亲姻日暂忙　\n到头竟必成中箭　贵人指引贵人乡\n此卦因祸得福之象　凡事营谋吉利也\n有意兴变　到底安然　若问用事　只近贵人\n自身  顺利　\n求财  有　\n交易  成　\n婚姻  合　\n是因祸致福之签。凡事则吉者也。日欲求好事喜非常。暂时安当守份之时。虽是不合之时。亦可有成之时。贵人自有贵人引导之者。因此。君尔之前途是极光明者。有事盼望到底如斯若问此事贵人提携耶。');
INSERT INTO `draw_lots` VALUES (12, '上签\n武吉遇师\n寅宫\n否去泰来咫尺间　暂交君子出于山　\n若逢虎兔佳音信　立志忙中事即闲\n此卦祸中有福之象　凡事先凶后吉也\n换麻得丝　击人双足　要见分明　因灾得福\n自身  吉　\n求财  有　\n交易  宜迟　\n婚姻  成　\n时临否极泰当来。多年来之恶运。霉道已去。吉星高照之时。事事顺利。一路顺风。毫无阻碍者。将身上抖之擞之。身上之暗埃尽去。尤在卯寅佳信至时。要之。麻换得丝是笑。虽哭要见分明足见为福。');
INSERT INTO `draw_lots` VALUES (13, '中签\n罗通拜帅\n寅宫\n自小生在富贵家　眼前万物总奢华　\n蒙君赐紫金腰带　四海声名定可夸\n此卦龙门得通之象　凡事有变大吉也\n囚人逢赦　病即安然　龙门得遇　名遍名都\n自身  祈福　\n求财  秋冬吉　\n交易  宜迟　\n婚姻  合　\n君尔也。自小生身富贵之家。於是君汝之生活也。总是奢华之世界者。谋望皆成。惟有贵人之扶持者。必能称意。且不劳而成者。易言之。囚徙得赦。病遇华陀。龙门得过。名显皇都之象。凡事变化则吉也。');
INSERT INTO `draw_lots` VALUES (14, '中签\n子牙弃官\n卯宫\n宛如仙鹤出凡笼　脱得凡笼路路通　\n南北东西无阻隔　任君直上九霄宫\n此卦仙鹤离笼之象　凡事先凶后吉也\n任意无虞　路有亨通　随心自在　逍遥如人(神)\n自身  还愿　\n求财  合　\n交易  合　\n婚姻  合　\n为白鹤冲天之象也。凡事先忧後吉之大吉签。功名成就。生意鼎盛。婚姻完满。财路亨通之时。宜再多阅圣贤书。修吾身。积吾德。必有喜讯连连之日来也。要之。从心无虑远达亨衢道心自在任意所如者耶。');
INSERT INTO `draw_lots` VALUES (15, '中签\n苏秦得志\n卯宫\n　忽有灾事勿近前　\n巢破林鸟无所宿　可寻深处稳安身\n此卦鸟鹊巢(离)林之象　凡事到底应心也\n若人得怨　何时可伸　好言不信　守旧待时\n自身  谨防　\n求财  吉　\n交易  成　\n婚姻  阻滞　\n本签示之於**日。触人口气最难吞。如交友中盛气凌人者。令人难以容忍者。亦即是灾厄临时之兆。不可不知也。得罪於人者。如覆巢之祸。爰之。劝君稳便一语存於心。方能有吉。易言之。若得人怨何事可伸。如言不信到底为劳心。巢空之象。因此。凡事守旧则吉者也。');
INSERT INTO `draw_lots` VALUES (16, '中签\n叶梦熊朝帝\n卯宫\n愁眉思虑暂时开　启出云霄喜自来　\n宛如粪土中藏玉　良工荐举出尘埃\n此卦阴阳和合之象　凡所谋皆吉也\n得处无失　损中有益　小人逢凶　君子顺吉\n自身  秋冬吉　\n求财  成　\n交易  成　\n婚姻  成　\n如玉在污泥中之象。如获良玉－贵人一举。牵成时。出污泥则。可获吉也。亦即是表明君之今也。咫尺－眼前之灵即拨开得见日者。时运将到者。曰：得处无伪损中有益顺逆吉凶君子得吉之签。');
INSERT INTO `draw_lots` VALUES (17, '中下签\n曹操话梅止渴\n卯宫\n莫听闲言说是非　晨昏只好念阿弥　\n若将狂话为真实　书饼如何止得饥\n此卦书饼充饥之象　诸事多虚少实也\n心中不定　枉看经文　恰似书饼　食也难吞\n自身  顺利　不顺　\n求财  顺利　甭想　\n交易  顺利　且慢　\n婚姻  阻　\n如心中不定则看轻也枉费心神是己。何以为之。又如人之妄语信之为真。岂非如画饼之充饥。焉得饱食。因时运之末到。时有吉。时有凶。劝**宜晨昏多念阿弥陀佛。莫听闲言及是非。方可安行。凡事虚少实也。');
INSERT INTO `draw_lots` VALUES (18, '上签\n曹国舅为仙\n卯宫\n金乌西坠兔东升　日夜循环至古今　\n僧道得知无不利　士农工商各从心\n此卦阴阳消长之象　凡事遂意之兆也\n心中无事　所作有功　如弓上箭　一发当空\n自身  吉　\n求财  顺　\n交易  成　\n婚姻  合　\n本签为皎月当夜空。繇东方上升之象。爰之事事亨泰如意者。心中无事。所作皆奏功。又如上弓之一箭。发之即中也。君之今堪称如日月日夜循环恒古今。僧到得之无不利。因此。工商农士无不一一笑颜逐开者。');
INSERT INTO `draw_lots` VALUES (19, '中签\n子仪封王\n辰宫\n急水滩头放船归　风波作波欲何为　\n若要安然求稳静　等待浪静过此危\n此卦船行急滩之象　凡事守旧待时也\n急水下船　险处待时　若问营谋　尽(不)可施为\n自身  作福　\n求财  未成　\n交易  未成　\n婚姻  不就　\n行舟浪洵之象。亦即是险境者。要之。君尔应知目下宜守旧。愿遵守静则吉。妄为则凶也。杨雄之仕王莽之朝为大夫。何以能胜大任。如在急水滩头放水之险行。待时若问营谋。时至方可为。千万叵轻举妄动。');
INSERT INTO `draw_lots` VALUES (20, '中签\n姜太公遇文王\n辰宫\n当春久雨喜开晴　玉兔金乌渐渐明　\n旧事消散新事遂　看看一跳遇龙门\n此卦久雨初明之象　凡事遂意也\n神佛护持　有灾无危　途生平安　到底荣归\n自身  祈福　\n求财  未遇　\n交易  待时　\n婚姻  随意　\n本签者也。久雨初晴之象。为万事可成之兆。惟得此吉签。必须早植因缘。之後当有莫大利益。君尔在交友之中。宜留意者。必须选中之一为贵人。彼将成王公封爵之贵。将有大成之日。汝必能攀附上。易言之。佛神护佑百事无忧想平生事到底初胜者。');
INSERT INTO `draw_lots` VALUES (21, '上签\n李旦龙凤配合\n辰宫\n阴阳道合总由天　女嫁男婚喜偎然　\n但见龙蛇相会合　熊罴入梦乐团圆\n此卦阴阳道合之象　凡事和大吉也\n谋望从心　婚姻孕男　资财进益　更利  利　\n求财  有　\n交易  成　\n婚姻  合　\n君得之签为阴阳道合之签也。凡事和合而大吉者。君逢此为上吉之运。凡事渐获进步。惟不可欲速成。更不得存有欺人之心。今之形成者。获来不易。佳境之时。宜更修之。省之。积吾善可也。易言之。君之今。营谋皆逐。婚姻孕男。资财积聚更吉田亩之收。');
INSERT INTO `draw_lots` VALUES (22, '中签\n六郎逢救\n巳宫\n旱时田里皆枯槁　谢天甘雨落淋淋　\n花果草木皆润泽　始知一雨值千金\n此卦旱逢甘雨之象　凡事难中有救也\n田蚕倍熟　命运渐来　病遇良药　行人不便\n自身  安　\n求财  颇有　\n交易  迟　\n婚姻  合　\n本签告之**曰。久旱而逢雨之象。简易之。遇难中有贵人救之象也。因之。凡事遇难。千万不能馁志。不能心灰意懒。垂头丧气。君汝之命中。凡逢难事。必有贵人来扶之。如行人之有阻。但贵人代之。具有行人来之效。要之。田禾能倍收。谋望相宜。病逢妙药。行人使归之好运者也。');
INSERT INTO `draw_lots` VALUES (23, '中签\n怀德招亲\n巳宫\n欲扳仙桂入蟾宫　普开天门不任君　\n忽遇一般音信好　人人皆笑岭顶花\n此卦手扳仙桂之象　凡事必有贵人也\n商贾利益　行戴有(无)危　病安讼遂　尽可施为\n自身  作福　\n求财  遂意　\n交易  合　\n婚姻  阻　\n本签为望仙扳桂之象。凡事必能遇赀人之象者。虽属上平。惟宜多作福。求神庇佑之。方有化凶趋吉之时。到头。君汝谋望一般喜讯好。高人。贵人也。日将佳音报之而来。要之。商贾者有利。行藏无危。病可安。讼可理。尽可施为。');
INSERT INTO `draw_lots` VALUES (24, '下签\n殷郊遇师\n巳宫\n不成理论不成家　水性痴人似落花　\n若问君恩须得力　到头方见事如麻\n此卦痴人道塞之象　凡事守旧待时也\n是非莫说　必须仔细　心正理直　方免灾危\n自身  险　\n求财  阻　\n交易  难　\n婚姻  待时　\n本签即是痴人丧德之象。凡事守旧待时。君汝目下即是水泡痴人似落花之命也。事事应顺天理。方平安。眼中无人之时。将何。必有福祸来临。不可不慎。亦即是到头毕竟如麻者。爰之。凡事求神作福。祷告。');
INSERT INTO `draw_lots` VALUES (25, '中签\n姚能受职\n巳宫\n过了忧危事几重　从今再立永无空　\n宽心自有宽心计　得遇高人立大功\n此卦古井逢泉之象　凡事贵人成就也\n讼终有理　病得安全　出入求谋　古井逢泉\n自身  阻滞　\n求财  阻滞　\n交易  阻滞　\n婚姻  和合　\n君之签。是宽心自有宽心计。得遇高人－贵人也。方能护圣功。易言之。凡事遇贵人方能吉也。亦即能过了忧危第几重。从今再历永无凶之境。凡事谋略之时必守之。不宜盲目冲之。三思而後行。方不致吃大亏。是到头来讼中有理。病得安癒。出外求外。枯井逢泉者也。');
INSERT INTO `draw_lots` VALUES (26, '中下签\n钟馗得道\n巳宫\n上下传来事转虚　天边接得一封书　\n书中许我功名遂　直到终时亦是虚\n此卦虚名之象　凡事虚多少实宜守旧也\n上下心烦　求闲不闲　欲望功名　守旧身安\n自身  安　\n求财  阻　\n交易  不成　\n婚姻  不成　\n是接目虚望之象。宜守旧待时者。不可听信世人之言。宜自吾有主见。以智止谣。何必听人之者。宜向神求之。神灵加护之时。必有转机。因直待终时亦是无者。因此。守之。规谋之。待来日之计用之。易言之。求闲不闻。目下心烦。欲求名利。徒尔虚投者。');
INSERT INTO `draw_lots` VALUES (27, '中签\n刘基谏主\n午宫\n一谋一用一番书　虑后思前不敢为　\n时到贵人相助力　如山墙立可安居\n此卦屋好墙壁之象　凡事稳当无险也\n改旧成新　寒花遇春　从前阻滞　今得称心\n自身  吉　\n求财  有　\n交易  难　\n婚姻  阻　\n本签者。墙有基址之家。凡事接引贵人乡者。君之今也。一谋一事一番机之时。举棋不定之刻。惟君正逢贵人助也。有银墙铁壁所安靠之人。虽有贵人之签。必须慎交。方有向善之效。否则受伊人愚弄。反得败名。');
INSERT INTO `draw_lots` VALUES (28, '中签\n包公寻李后\n午宫\n东边月上正蝉娟　顷刻云遮亦暗存　\n或有圆时还有缺　更言非者亦闲言\n此卦月被云遮之象　凡事昏迷未定也\n浮云遮月　不须疑惑　等待云收　便见明白\n自身  祈保　\n求财  阻　\n交易  吉　\n婚姻  不合　\n本签为月被云遮之象。亦即是凡事。暂时且守旧。待时老。君汝之早年也。事事不遇之时。唯多年辛勤。终能入佳境。事事如意者。好景已迫眉睫。愿君多行善。亦即是言积德。以迓天庥者。君之目前即是浮云遮月不得疑惑。得待云开自见明月时。');
INSERT INTO `draw_lots` VALUES (29, '中签\n赵子龙救阿斗\n午宫\n宝剑出匣耀光明　在匣全然不惹尘　\n今得贵人携出现　有威有势众人钦\n此卦宝剑出匣之象　凡事有威有势也\n宝剑出匣　光辉万里　贵人指引　无不观美\n自身  吉　\n求财  利　\n交易  成　\n婚姻  好　\n本签示之曰。是宝剑出匣之象。凡事有高人指出时。必有成者。尽可防身更无疑者。时运已济。安闲守分。至卯年月。大有发展。锋芒毕露者。士子科第。仕官之人。得擢升。另言之。宝剑出匣光辉万里贵人指出。无不赞美者也。');
INSERT INTO `draw_lots` VALUES (30, '中签\n棋盘大会\n午宫\n劝君切莫向他求　似鹤飞来暗箭投　\n若去采薪蛇在草　恐遭毒口也忧愁\n此卦安份守己之象　凡事小心谨防也\n闭口含齿　他事莫理　若有亏心　到头害己\n自身  平平　\n求财  待时　\n交易  滞　\n婚姻  未许　\n本签示之曰。若去采薪蛇伏草。恐遭毒手也堪虞之命途耶。是安身得己之象。凡事暂守旧待时之者。谋事不相宜。一事无成者。田亩。六畜之不利於时。唯山坎是大吉者。易言之。闭口存舌。闲事莫理不可生心恐伤于己。');
INSERT INTO `draw_lots` VALUES (31, '中签\n佛印会东坡\n未宫\n清闲无忧静处侩　饱后吃茶时坐卧　\n汝下身心不用忙　必定不招冤与祸\n此卦守旧安然之象　凡事时待时则吉也\n守旧安然　叩问神仙　直待时来　事亦偶然\n自身  安　\n求财  守待　\n交易  宜迟　\n婚姻  合　\n本签曰。清闲无事静处坐。饥时吃饭困时卧。可知君尔者当守己安静之时。凡事宜守旧。不宜在此时轻举妄动。动则凶。静则吉之刻。放下身心不用忙。唯有如此。方可除去祸与殃。易言之。守己安静即是待他时之至。必定周全。');
INSERT INTO `draw_lots` VALUES (32, '中签\n刘备求贤\n未宫\n归程杳杳定无疑　石中藏玉有谁知　\n一朝良匠分明剖　始觉安然碧玉期\n此卦剖石见玉之象　凡事著力成功也\n宝在石中　异人少知　直待分明　尽可施为\n　\n自身  安　\n求财  劳力　\n交易  阻　\n婚姻  成　\n本签示於**曰。君今之命运也。如石中剖玉之象。八百事啻要费力即可成者。易言之。汝是石中藏玉虽知。孜孜不倦中取玉之勤劳人。人生旅途中。常有惊险之象出现。易言之。玉在石中。匠手可知。直待剖出真可施。');
INSERT INTO `draw_lots` VALUES (33, '中签\n咬金聘仁贵\n未宫\n内藏无价宝和珍　得玉何须外界寻　\n不如等待高人识　宽心犹且更宽心\n此卦藏玉外寻之象　凡事待时可也\n内藏金玉　不识外寻　遇贵指引　不须劳心\n　\n自身  安　\n求财  守待　\n交易  迟　\n婚姻  就　\n又是珍玉内藏之象。是凡事忍耐得吉者也。君汝之今也。谋略不宜之时。乍看似机缘。行之反覆为之。无一事可成。石中既有玉藏。何必向外去寻。亦即是君守於今。自有展谋之时。不宜动。动不如一静。易言之。珍玉内藏不时求。不见待若遇贵人。事则得吉。');
INSERT INTO `draw_lots` VALUES (34, '中上签\n桃园结义\n未宫\n行藏出入礼义恭　言必忠良信必从　\n心不了然且静澈　光明红日正当中\n此卦红日当空正照之象　凡事遂意也\n心中无事　秋水澄清　不须疑惑　事自然成\n　\n自身  安　\n求财  虚　\n交易  难　\n婚姻  合　\n本签也。红日当空之象。凡事自来有成。君之今也。出入行藏礼义恭。言必忠良听必聪。与友朋。长辈之交。必须礼恭。天下之事能透彻。君之运也。光明则如日正当空时。易言之。空中无事秋水澄清别无阻碍。自然有成者。');
INSERT INTO `draw_lots` VALUES (35, '中签\n唐僧取经\n申宫\n衣冠重整旧家风　道是无穹却有功　\n扫却当途荆棘刺　三人约议再和同\n此卦衣冠重整之象　凡事先难后易也\n不用忧疑　自有佳期　若问前程　前路可宜\n　\n自身  吉　\n求财  好　\n交易  利　\n婚姻  阻　\n此签是扫却当途荆棘碍。三人共议事相同者。可知重整之象。凡事改变即大吉。功名。交易均可得利。求财。时运。六畜亦均有利可图。是谋略成功。年运亨通之时。一旦称心。万事通之刻。君汝之今为不须忧虑。自有期间。前程事更换可宜。');
INSERT INTO `draw_lots` VALUES (36, '中签\n湘子遇宝\n申宫\n眼前病讼不须忧　宝地资财尽可求　\n恰似猿猴金锁脱　自归山洞去来悠\n此卦猿猴脱锁之象　凡事先难后易也\n脱除了事　且自宽心　待得时来　堪寻正路\n　\n自身  安　\n求财  大利　\n交易  待时　\n婚姻  未成　\n本签曰。目前病讼不须忧。实地资财尽可求。是上上之签。惟有积德。布施之举。必可更进展之机。如忽尔遇不如意之时。因君汝目下是系猿脱锁之象。凡是通泰。因此。再加修心向善。必有神佑。易言之。且自宽舒待他时至路达通衢也。');
INSERT INTO `draw_lots` VALUES (37, '中签\n李靖归山\n申宫\n欲待身安动泰时　风中灯烛不相宜　\n不如收拾深堂坐　庶免光摇静处明\n此卦风摇灯烛之象　凡事守常则吉也\n静处安身　待命守时　支惹非福　守旧相宜\n　\n自身  平平　\n求财  有　\n交易  难　\n婚姻  不合　\n本签也。风前灯烛之签也。不相宜者。惟凡事小心。谨慎则吉也。君必须收拾深堂坐。亦即是得静为宜吉。如动则凶至。只好暂时忍耐之。时到之时。必有吉祥之象。随君而来。易言之。静处安身命待时泰。动心惹祸。静守救危耶。');
INSERT INTO `draw_lots` VALUES (38, '下签\n何文秀遇难\n申宫\n月照天宅静处期　忽遭云雾又昏迷　宅有作书\n宽心祈信云霞散　此时更改好施为\n此卦云雾遮月之象　凡事未遂守旧也\n家道忧凶　人口有灾　祈福保庆　犹恐破财\n　\n自身  祈保　\n求财  难　\n交易  待时　\n婚姻  难合　\n本签为浮云遮月之象。目前事事无须如意之时亦即是劝君叵动。俟时运之来至。动之方吉利。唯有汝宽心守待。耐心待至拨云见皎洁月娘时。汝即家居无忧。人口阴灾作福。保佑之。不致有破财之时。守之。不宜不遵行。');
INSERT INTO `draw_lots` VALUES (39, '下签\n姜女寻夫\n酉宫\n天边消息实难思　切莫多心望强求　\n若把石头磨作镜　曾知枉费己功夫\n此卦守常安静之象　凡事守己则吉也\n千般用计　枉费功夫　不如守旧　著甚来由\n　\n自身  提防　\n求财  平平　\n交易  阻　\n婚姻  不合　\n本签告之於**曰。若把石头磨成镜。精神枉费一时休之安静守旧之象也。一切事宜皆在低潮中。宜小心。小心。如六畜之损。田亩之亏。宜拾旧图新。适合时潮。方能振兴起色。六甲生女亦不必气馁。宜积德。修身为先。必有赖之。易言之。千般用计届时皆空心守旧。不必强求者。');
INSERT INTO `draw_lots` VALUES (40, '中签\n武则天登位\n酉宫\n红轮西坠兔东升　阴长阳消百事亨　\n是若女人宜望用　增添财禄福其心\n此卦阴长阳消之象　凡事先难后易也\n阴利女人　不宜男子　若是求谋　先凶后吉\n　\n自身  祈福　\n求财  守待　\n交易  吉　\n婚姻  不合　\n  女本签是阴长阳消之家。凡事先难後吉者。不管是交易。求财。时运。均在开始时。均为不利。但是因一己之奋斗。苦心造诣。终有出头之日。所幸田亩大收。六畜兴旺。皆是祈福所赐。疾病。皆有险。宜小心。易言之。阴利女人。不宜男子。若问求望。无忧从喜。');
INSERT INTO `draw_lots` VALUES (41, '中签\n董卓收吕布\n酉宫\n无限好言君记取　却为认贼将作子　\n莫贪眼下有些甜　更虑他年前样看\n此卦认贼作子之象　凡事认真作假\n只这一著　君子莫错　牢记在心　不生寂寞\n家宅  (不)安　\n自身  平常　\n求财  守待　\n交易  难　\n婚姻  未合\n本签示於**曰。认贼为子之象。不宜苟且者。神戒之曰。莫贪眼下有些甜头。趋之。後果堪虞。到头来还是受苦者。功名。交易。尚不理想。求财皆在待时之命运。为认贼作子之时。易言之。只道一著君子莫错宰把身心不致耽搁。');
INSERT INTO `draw_lots` VALUES (42, '上签\n有莲见母\n酉宫\n君皇圣后终为恩　复待祈禳无损增　\n一切有情皆受用　人间天上得期亨\n此卦天垂恩泽之象　凡事成就大吉也\n天皇降恩　始终莫忘　晨昏礼念　可宜烧香\n　\n自身  冬吉　\n求财  未有　\n交易  成　\n婚姻  中吉　\n本签示之曰。天垂甘露之泉。凡事大吉利者。亦即是先难後易者所得。功名成。交易就。婚姻虽平庸。但是难得之缘也。时运至冬季即至。六畜。田亩皆旺之时。宜勤俭。千万不得浪透。陷已於绝境者。易言之。天降甘露。君子莫忘求谋成就。和合吉昌之签也。');
INSERT INTO `draw_lots` VALUES (43, '上签\n行者得道\n戌宫\n天地变通万物全　自营自养自安然　\n生罗万象皆精彩　事事如心谢圣贤\n此卦大地交泰之象　凡事大吉无危也\n天生万物　谋望皆通　福德相助　瑞气匆匆\n　\n自身  安　\n求财  有　\n交易  利　\n婚姻  合　\n本签为天地交泰之象。是事事和谐得称人者。季冬有喜。交春之时。人事遂意者。必是喜事连连之人。万象新之时。自形自色自怡神。事事吉祥之际遇。相机而动者。易言之。本签者天生万物谋望皆新福德积聚瑞气添增。可喜之签也。');
INSERT INTO `draw_lots` VALUES (44, '中签\n姜维邓艾斗阵\n戌宫\n棋逢敌手著相宜　黑白盘中未决时　\n皆因一著知胜败　须教自有好推宜\n此卦棋逢敌手之象　凡事用机关则吉也\n欲求心事　恰如围棋　到底胜利　宜用心机\n　\n自身  平稳　\n求财  遂　\n交易  利　\n婚姻  未合　\n本签为棋逢敌手之象也。凡事先吉。凡未小心。节俭则有转恶之嫌。宜小心为之。棋逢敌手之时。必藏有机。决定胜负之时莫迟疑。认为可行则毫不犹豫之下即可。尤应和者。善有善报。恶有恶报。示人早知觉悟多作善。方能有善报者。');
INSERT INTO `draw_lots` VALUES (45, '上签\n仁宗遇仙\n戌宫\n温柔自古胜刚强　积善之门大吉昌　\n若是有人占此卦　宛如正渴遇瑶浆\n此卦积善温柔之象　凡事贵人和合也\n天地有感　应验非常　佛神护佑　得之莫忘\n　\n自身  安　\n求财  遂　\n交易  利　\n婚姻  合　\n本签为积福门庭之象。凡事谋则吉者也。灵签曰。温柔自是胜强刚。积善于门大吉昌。为使己之事务。求财。时运吉昌者。必须积善。修德。布施。方能亨之。久而弥坚。易言之。天地有感应验非常佛神保持得福寿长之签。');
INSERT INTO `draw_lots` VALUES (46, '中签\n渭水钓鱼\n戌宫\n勤君耐守旧生涯　把定心肠勿起歹　\n直待有人轻著力　枯枝老树再生花\n此卦枯木生花之象　凡事自有成就也\n守旧守旧　事自成就　动则多殃　静则无咎\n　\n自身  吉　\n求财  待时　\n交易  成　\n婚姻  就　\n本签为枯木生花之家。即是万物逢春复苏之象。君尔多年辛劳得报於斯时。惟早植因缘。必有喜事连连。诗日：劝君耐守旧生涯。爰之。君之今宜静。不宜动。动则凶。静则吉。亦方能枯木再开花。向使逢遇贵人。可攀之。伊者後日之诸侯。易言之。决心守旧时至成就行多多逆。安静无忧。');
INSERT INTO `draw_lots` VALUES (47, '上签\n梁灏登科\n亥宫\n锦上添花色愈鲜　运来禄马喜双全　\n时人莫恨功名晚　一举登科四海传\n此卦锦上添花之象　凡事大吉大利也\n守旧变新　运至材成　遂平生志　尽皆是命\n  吉　\n自身  安　\n求财  利　\n交易  阻　\n婚姻  合　\n本签者。福禄双全之象者。凡事兴隆大吉之签。曰锦上添花色更鲜。运来之时也喜双全。八十二对大魁。不是晚也。奉献社会人群。积吾德。荫子孙。何乐不为。为天数之所赐。宜再积德。方有同点灯之故。易言之。儿有双亲。守时待庆遂平生志。都来自命。');
INSERT INTO `draw_lots` VALUES (48, '中签\n韩信挂帅\n亥宫\n昆鸟秋来化作鹏　好游快乐喜飞腾　\n翱翔万里云霄去　余外诸禽终不能\n此卦昆鹏兴变之象　凡事有变动事\n昆化为鹏　万禽不能　桂香一折　福禄自增\n　\n自身  吉　\n求财  秋旺　\n交易  迟　\n婚姻  不合　\n本签为昆鸟乌化鹏之吉象也。凡事皆能兴隆大吉。功名成之。利得之。婚合之。六畜旺之。六甲全之。官事。等等。无一不顺利也。直冲云霄之外。无可与伦比者。惟逢此佳境。勿忘今之所由成。积德。布施之再行者。可维护君尔之谋望无疑。易言之。今之君也。桂花时节财禄成此。');
INSERT INTO `draw_lots` VALUES (49, '中签\n王祥求鲤\n亥宫\n天寒地冻水成冰　何须贪吝取功名　\n只好守己静处坐　待叶兴盛自然明\n此卦水结成冰之象　凡事不用枉求也\n水结成冰　冰消成水　若是营谋　到底如是\n　\n自身  祈保　\n求财  难　\n交易  阻　\n婚姻  不合　\n');
INSERT INTO `draw_lots` VALUES (50, '中签\n陶朱归五湖\n亥宫\n五湖四海任君行　高挂帆蓬自在撑　\n若得顺风随即至　满船宝贝喜层层\n此卦顺风撑船之象　凡事皆顺大吉也\n自在休悠　不须著力　财禄重重　无不欣美\n　\n自身  吉  待运至　\n求财  利西　\n交易  宜迟　\n婚姻  不合　\n');
INSERT INTO `draw_lots` VALUES (51, '中上签\n孔明入川\n子宫\n夏日炎天日最长　人人愁热闷非常　\n天地也解知人意　薰风拂拂自然凉\n此卦人人愁热之象　凡事随心从意也\n进退莫疑　自有佳期　营谋用麽　不须妄为\n　\n自身  谨防　凶中有吉　\n求财  秋吉　\n交易  平常　\n婚姻  合　\n本签之诗也。炎天生凉之家。凡事所谋稳当者。虽是中平之签。人生之乐在於此。凡事知足之时即大安。谋事不宜因小嫌弃。改大则败者。一石拾之嫌小。舍之。再拾之。无一而足者。到头无石可捡。易言之。进用莫疑。最佳期日至。凡成谋望。不须忧虑。');
INSERT INTO `draw_lots` VALUES (52, '中下签\n太白醉捞明月\n子宫\n水中捉月费功夫　费尽功夫却又无　\n莫说闲言并乱语　枉劳心力强身枯\n此卦贪求费力之象　凡事劳心费力也\n言诺难思　费力劳心　宅中忧虑　等遇贵人\n　\n自身  欠吉  凶　注意健康　\n求财  中平  休想\n交易  难　\n婚姻  未就　');
INSERT INTO `draw_lots` VALUES (53, '中签\n刘备招亲\n子宫\n失意番成得意时　龙吟虎啸两相宜　\n青天自有通霄路　许我功名再有期\n此卦龙吟虎啸之象　凡事顺意有望也\n教去即去　自有亨通　到头必制　立地可谋\n　\n自身  欠吉　先凶后吉　\n求财  中平　\n交易  难　\n婚姻  成就　\n本签之诗也。炎天生凉之家。凡事所谋稳当者。虽是中平之签。人生之乐在於此。凡事知足之时即大安。谋事不宜因小嫌弃。改大则败者。一石拾之嫌小。舍之。再拾之。无一而足者。到头无石可捡。易言之。进用莫疑。最佳期日至。凡成谋望。不须忧虑。');
INSERT INTO `draw_lots` VALUES (54, '下签\n马超追曹\n子宫\n梦中得宝醒来无　自谓南山只是锄　\n若问婚姻并问病　别寻来路为相扶\n此卦梦中得宝之象　凡事枉费心力也\n物在水中　形影长短　皆有分定　不用商量\n　\n自身  谨防　\n求财  阻　\n交易  难　\n婚姻  待时　\n本签曰。梦中得宝醒来无。可知君之谋望。均归虚者也。功名。交易。婚姻。求财等。皆守旧方可。目下之所由成者积德。修身之不足所由生。爰之。更在修阴骘方面多下功夫。必有转机之时。前程方可远大。易言之。本签也。戒人去恶从善。趋吉化凶者也。');
INSERT INTO `draw_lots` VALUES (55, '中上签\n周武王登位\n丑宫\n父贤传子子传孙　衣食丰隆只靠天　\n堂上椿萱人快乐　饥饭渴饮困时眠\n此卦接竹引泉之象　凡事谋望大吉也\n接竹引泉　流传不绝　君子谋望　无不欣悦\n　大吉　\n自身  还愿　大吉　\n求财  利　\n交易  成　\n婚姻  合　遇佳婿　\n本签示於**曰。子孙贤。衣禄丰盈富在天。君尔之命。即是富贵天定者。大吉大利之签者。功名。交易。婚姻。求财皆如意者。而且吃饭困时眠之运。逢此大吉利之时。宜多修德。积善。更可发阳光大者。');
INSERT INTO `draw_lots` VALUES (56, '中签\n禄山谋反\n丑宫\n滩小石溪流水响　风清明月贵人忙　\n路须借问何方去　莫取林中花草香\n此卦船行小滩之象　凡事有贵人助也\n营谋用事　劳心费力　守旧待时　凡事大吉\n　\n自身  吉　\n求财  中平　\n交易  利　\n婚姻  遂　慎　\n本签是涧水行船之象。是凡事先难後吉者。虽是君尔力劳撑驾。恐有损伤。先是劳而无功。路顺指出前江去。自有风静浪平。一路顺风之时。必须更修身。积善。布施。天心感应之时。必有更上一层楼之列。易言之。涧小滩多掌船劳力指出前江风帆顺得。');
INSERT INTO `draw_lots` VALUES (57, '中签\n董仲寻亲\n丑宫\n说是说非风过耳　好衣好禄自然丰　\n君莫记取当年事　汝意还如我意同\n此卦孩儿见母之象　诸事贵人大吉也\n所用谋望　皆大欢喜　从公用力　如子逢娘\n　\n自身  平平　\n求财  顺　\n交易  成　\n婚姻  合　\n本签者好子见娘之象。凡事能遇贵人则化吉也。凡遇事可受贵人扶之。提携之後可成。必为其人所敬仰。一倡百和者。事事可以成功。好衣好禄日当空。易言之。选用谋望皆大吉昌。从心切恳。如子见娘。');
INSERT INTO `draw_lots` VALUES (58, '中签\n文王问卜\n丑宫\n直言说话君须记　莫在他乡求别艺　\n切须守己旧生涯　除是其余都不利\n此卦守旧守时之象　凡事守旧则吉也\n得住且住　可取且踞　莫宜别事　只宜守旧\n　\n自身  不利　\n求财  吉　\n交易  成　\n婚姻  阻　\n本签者。耍君尔必守旧生涯之象。凡事必须三思而後行。不宜轻举妄动。诗曰。忠言善语君须记。千万因不满现况而见异思迁。一股干劲。结果带来不可收抬之残局。是时悟知。不如不作。即时已晚。噬脐不及者。易言之。得往且往可往旧路温故知新。莫求别路。');
INSERT INTO `draw_lots` VALUES (59, '中下签\n张良隐山\n寅宫\n直上重楼去藏身　四围荆棘绕为林　\n天高君命长和短　得一番成失二人\n此卦守旧随时之象　凡事待时则吉\n如醉饮酒　只宜守旧　直待时来　无灾无咎\n　\n自身  安　运滞　唯仁可解　\n求财  平常　切忌　\n交易  成　且慢　\n婚姻  不合');
INSERT INTO `draw_lots` VALUES (60, '下签\n赤壁鏖兵\n寅宫\n抱薪救火大皆燃　烧遍三千亦复然　\n若问荣华并出入　不如收拾枉劳心\n此卦抱薪救火之象　凡事亦自谨防也\n有千般计　一旦相惹　不如莫动　恐惹祸身\n　\n自身  祈保　\n求财  微微　\n交易  不合　\n婚姻  不合　\n本签示之於**曰。抱薪救火。当然火会增烟。霉头加以霉繇此可知。君尔凡是著手兴事。必须守旧。千万不能逞一时之勇。见人之成。见异思迁。轻举妄动。恐怕有大害。不仅不能成事。反而将事弄砸。得不偿失。易言之。总有千般。一旦皆休。安心守旧维得无忧。');
INSERT INTO `draw_lots` VALUES (61, '中签\n苏小妹难夫\n寅宫\n日落吟诗月下歌　逢场作戏笑呵呵　\n相逢会遇难藏避　唱彩齐唱连理罗\n此卦守旧随时之象　凡事时吉利也\n佳人在屋　吟唱诗曲　一片欢心　命中祸福\n　\n自身  吉　\n求财  顺　\n交易  利　\n婚姻  成　\n本签之示於**曰。日上吟诗日下歌者。为佳人欢乐之象者。凡是百事兴。大吉昌之徵。因时运知。所谋之事也。百事如意之时。惟将如此康泰上盈之道。何如保之。冤之。保之。方能克终。易言之。君之今也。佳人在屋唱。吟诗曲一片欢嘉取乐且足之佳境。');
INSERT INTO `draw_lots` VALUES (62, '中签\n唐僧得道\n寅宫\n晨昏传籁佛扶持　须是逢危却不危　\n若得贵人相引处　那时财帛亦相随\n此卦神佛暗佑之象　凡事忍耐大吉也\n平平稳稳　四方名显　改旧从新　亦无凶险\n　\n自身  吉　\n求财  西方　\n交易  遂　\n婚姻  成　\n本签也。守旧平安之象。凡兴事。能遇贵人扶持之时。必能顺利者。晨昏全赖佛祖扶持。因之。必须先由吾身之修德。积善始。神方能有所庇佑。凡事须隐忍。藏器以待用。不宜急。不可躁。易言之。君之命也。诸事平稳四方名显。改换从新。凶存吉现也。');
INSERT INTO `draw_lots` VALUES (63, '中签\n女娲氏炼石\n卯宫\n昔然行船失了针　今朝依旧海中寻　\n若然寻得原针在　也费工夫也费心\n此卦海中寻针之象　凡事费心劳力也\n福是缘基　缘是福种　说得分明　切宜守谨\n　\n自身  谨防　\n求财  有　\n交易  成　\n婚姻  不合　\n本签也。海底捞针之象。凡事费劳空力之徵。成为如此者。时也命也。不得违之。逞一时之强。却不得任何结果。反而受到不利。甚至吃亏。蚀本之情形出现。福是福基福埋福种。说得分明且宜手拱。');
INSERT INTO `draw_lots` VALUES (64, '下签\n马前覆水\n卯宫\n游鱼却在碧波池　撞遭罗网四边围　\n思量无计番身出　事到头来惹事非\n此卦鱼遭罗网之象　凡事亦宜提防也\n屋下安身　祸从天降　早觉先防　免遭灾殃\n　\n自身  险　\n求财  虚　\n交易  中平　\n婚姻  不合　\n本签者暗遭罗网四边围之命者。凡事必须提防歹人陷害。此运者起跌不常者。且虚。险。惊。改。凶之者多。经多方面涉尘。终能出险。惟此历程艰苦异常。无以数计。思量无计翻身出。易言之。身居尘内祸自天来。早须防备免受其灾。');
INSERT INTO `draw_lots` VALUES (65, '下签\n孙膑困庞涓\n卯宫\n眼前欢喜未为欢　亦不危时亦不安　\n割肉补疮为甚事　不如守旧待时光\n此卦割肉成疮之象　凡事只宜守旧待时\n知止则止　知宽自宽　割自身肉　疾痛一般\n　\n自身  口舌　\n求财  不利　\n交易  小人　\n婚姻  不长　\n凡事必须守旧待事。不宜轻举妄动者也。因时命之注定君尔之命眼欢喜未为欢。危不危兮安不安。日下运多拂逆。毫无利息可言。如百花凋落。无复荣华之望。几希万事皆空之势。易言之。如得止。且止知欢割自己肉痛一般。');
INSERT INTO `draw_lots` VALUES (66, '下签\n霸王被困\n卯宫\n路险马嬴人行急　失群军卒困相当　\n滩高风浪船棹破　日暮花残天降霜\n此卦船破下滩之象　凡事险阻提防也\n守旧守旧　安静无咎　不用求谋　自在优游\n　\n自身  灾耗　\n求财  破失　\n交易  败　\n婚姻  不长　\n本签者意滞之象。凡举事待时。且必须仔细小心。无一是处之时。目下不许君丝毫动之。一动不如一静。以目前之情况守之。不可勉强。一强求。逞一时之勇之时亏即主。弄巧成拙。无一可图利。易言之。守静安静。安分无忧不须贪望自有优游。');
INSERT INTO `draw_lots` VALUES (67, '上签\n金星试窦儿\n卯宫\n一条金线秤君心　无减无增无重轻　\n为人平生心正直　文章全贝艺光明\n此卦心平正直之象　凡事平稳无凶也\n心平正直　到底清平　只依本份　天下太平　\n自身  平　\n求财  守慎　\n交易  稳　\n婚姻  合　\n本签之曰。心中端正之象。凡事能平稳大吉之者。一条金銔等君情。由它衡量即是无减无增。无重轻为人之道。即是人心平生心正直之时。即使不识文章也明白义之道理。易言之。平生正直善处人情只依本份天下则泰平矣。清高门路即可。');
INSERT INTO `draw_lots` VALUES (68, '中上签\n郭汾阳祝寿\n卯宫\n门廷吉庆喜非常　积善之门大吉昌　\n婚姻田蚕诸事遂　病逢妙药即安康\n此卦春梦百花之象　凡事遇贵人大吉也 门廷吉庆之象　凡事顺遂也\n春深日暖　百花自开　事莫迟疑　从人显达　\n\n积善之家　必有余庆　忠义之门　拱照福星\n　\n自身  安　\n求财  春旺　\n交易  遂　\n婚姻  成　\n本签者。日暇风和之象。凡事大吉大利者。君尔之门庭清吉。梦也祯祥。古人劝之。积善之家庆有余。家运大吉大利也。积善者。先由心正。不存邪。助人为乐。修身。布施之谓。因之。讼理婚成蚕又熟。易言之。日暇风和百花大发事莫迟疑从今显达。');
INSERT INTO `draw_lots` VALUES (69, '中签\n梅开二度\n辰宫\n冬来岭上一枝梅　叶落枝枯终不摧　\n但得阳春悄急至　依然还我作花魁\n此卦梅花占魁之象　凡事宜迟则吉也\n一箭射空　当空不空　待等春来　彩在其中\n　\n自身  作福　\n求财  谨慎　\n交易  待时　\n婚姻  迟成\n本签者梅花占魁之象。凡事宜平吉利者也。冬至。岭上之一枝梅也。虽是叶落枯根。伊亦能傲霜斗雪疏影横斜。放出幽杳。为世人报得春之跫音将至。君多年之傲苦也。必得一报。出头天者。易言之。君之运也。一箭落空。非空不空看非得景致消息在中者。');
INSERT INTO `draw_lots` VALUES (70, '下签\n李密反唐\n辰宫\n朝朝恰似采花蜂　飞出西南又走东　\n春尽花残无觅处　此心不变旧行踪\n此卦蜜蜂采花之象　凡事劳心费力也\n无觅春色　久雨不晴　求谋动用　不如安静\n　\n自身  小人　\n求财  破耗　\n交易  反覆　\n婚姻  不长　\n本签是游蜂采花之家。凡事劳而无功者。飞来飞去而复东。春届暮节花残也无其觅处。栖身之所。交易。婚姻。求财。六畜。生产。皆无一是处。在此苦境之时。最宜修吾身。积吾善。行布施。善吾之言行。方能有转机。易言之。役役终朝。暗雨不清。用尽机谋争加寂寞者。');
INSERT INTO `draw_lots` VALUES (71, '中签\n文君访相如\n辰宫\n认知仓龙十九卫　女子当年嫁二夫　\n自是一弓架两箭　切恐龙马上安居\n此卦一弓架两箭之象　凡事再合则吉也\n不出重重　事由天命　振六中开　切宜谨守\n　\n自身  是非　\n求财  劳力　\n交易  谨防　\n婚姻  再合\n本签之示意者。一弓两箭之象。凡事改变则大吉者。骑龙跨马上安居。凡事切莫堕志。修心向善去。自有好处。目下虽略困。但是。终必逢时。但勤劳。人事己尽天理。无不准。易言之。不审不审事由天命辰午中间切须谨慎。');
INSERT INTO `draw_lots` VALUES (72, '中签\n王莽求贤\n辰宫\n养蜂须用求他蜜　只怕遭触尾上针　\n须是眼前有异路　暗惊深如荆棘林\n此卦结蜂采蜜之象　凡事劳心费力也　求甜得苦之象　凡事防范灾殃也\n事须仔细　不用强求　结蜂采蜜　有甚来由\n　\n自身  防　\n求财  阻　\n交易  迟　\n婚姻  阻隔　\n本签者。示於**曰。事须仔细不可强求为蜂采蜜看其由来。事後遂意。皆祖宗积德之所致。若能顺理而行。益加培植。则天之报施。凡事先苦後甘之象。必须忍耐。否则无由成功。由忍一字。将有转吉化凶之时。');
INSERT INTO `draw_lots` VALUES (73, '上签\n陈桥兵变\n巳宫\n春来雷震百虫鸣　番身一转离泥中　\n始知出入还来往　一朝变化便成龙\n此卦雷发百虫之象　凡事遇贵人吉兆也\n雷发时转　出入两存　一朝变化　直到天门\n　\n自身  平常　\n求财  春利　\n交易  贵人　\n婚姻  成合　\n本签示於**曰。是蛰中变态之象也。凡事变化则吉者。事事求变。舍旧图新。求合时潮。何必烦恼。一定可转机。多费心机。可有转变。君尔可知。功名富贵迟速有时。待时而动则吉也。易言之。震开蛰目忌入风云一好变态直入天宫。');
INSERT INTO `draw_lots` VALUES (74, '下签\n秦败擒三帅\n巳宫\n似鹄飞来自入笼　欲得番身却不通　\n南北东西都难出　此卦诚恐恨无穹\n此卦似鹄投水(笼)之象　凡事多虚少实也\n进身可(不)得　退步为(不)能　低头直去　悉在其中\n　\n自身  困滞　\n求财  小人　\n交易  破耗　\n婚姻  刑伤　\n本签示之於**曰。野鸡投笼之象。既然是投笼者失去自由之意。当自守旧留心。今之命也。东西南北浑障碍者。此身憔悴。恨无穷之时。正逢不堪景象。凡事守之。慎之。三思而後行方可。易言之。进身不得退步而行。命运乖蹇。切勿交争。');
INSERT INTO `draw_lots` VALUES (75, '中签\n伍员夜出昭关\n午宫\n恰如拖虎过高山　战战竞竞胆碎寒　\n不觉忽然从好事　切须保守一身安\n此卦抱(拖)虎过山之象　凡事险凶惊恐也\n危危险险　前程有阻　若问求谋　到底辛苦\n　\n自身  提防　\n求财  谨慎　\n交易  滞　\n婚姻  难顺　\n本签示之於**曰。宛如抱虎过山前之景也。令人战战竞竞瞻碎寒者。凡事必须多劈画。千万不得轻举妄动。机密不密则不成。须防口之血半。惟君尔之修身。积德功夫一至。必能逢得妙手。方能保得一身平安。易言之。危险阻隔前程切莫远行自宜守节。先凶後吉者。');
INSERT INTO `draw_lots` VALUES (76, '中签\n洪武看牛\n午宫\n鱼龙混杂意相同　耐守深潭待运通　\n不觉一朝头耸出　禹门一跳过龙宫\n此卦鱼龙未变之逸象　凡事待时至可也\n虽是滋基　也要待时　营谋自本　切莫妄为\n　\n自身  康泰　\n求财  有　\n交易  待时　\n婚姻  迟合\n本签者禹门未透之象。凡百事变化则吉之意。鱼与龙两者混杂潭中意和同。耐守於潭却未济中时。唯有一朝头角耸之刻。君尔即可由禹门一跃到天宫去者。贵人逢遇之日。必有被擢拔之时。彼时商贾者财利勃发。家宅产业兴隆。另言之。虽有址地不如待时营谋出入切莫安为。');
INSERT INTO `draw_lots` VALUES (77, '中签\n捧璧归赵\n午宫\n梦中说得是多财　声名云外终虚来　\n水远山遥难信实　贵人指点笑颜开\n此卦梦中得宝之象　凡事虚多少实也\n如梦说梦　声名莫望　只待好时　贵人指示\n　\n自身  阻　\n求财  虚　\n交易  难成　\n婚姻  不合　\n本签之示於**者。梦中得财之象。亦即是空虚无力者。总而言之。身外浮名。总无可猜：水远山遥难信定。伊是遥远之地。无法信之。定之。贵人一指时。君尔笑颜逐开。易言之。梦说梦声名虚望只好待时贵人接引。');
INSERT INTO `draw_lots` VALUES (78, '上签\n临潼救驾\n午宫\n冷水未烧白沸汤　不寒不热有温凉　\n要行天下无他事　为有身中百艺强\n此卦平善用事之象　凡事平稳大吉也\n囚人逢赦　病遇良医　求财谋望　贵人指示\n　\n自身  吉　\n求财  遂　\n交易  成　\n婚姻  合　\n本签即是平稳用事时凡事大吉利者。亦即是冷水来浇时也。白雪洋。时令不寒不热时自有温凉者。逢此时令时。君尔行天下时。并无他事。唯君汝。必须藏有一蛰之长久。可行天下无阻。易言之。囚徒可得久病遇良医。求财谋望贵人指迷。');
INSERT INTO `draw_lots` VALUES (79, '中签\n暗扶倒铜旗\n午宫\n虚空结愿保平安　保得身安愿不还　\n莫忘神圣宜还了　此知神语莫轻慢\n此卦信实莫信虚之　凡事守旧之兆也\n人有我见　心不用忙　观音指示　切莫轻慢\n　\n自身  许经　\n求财  守份　\n交易  谨慎　\n婚姻  虚　\n本签示之於**者。信实不虚凡事待时耐守则吉之灵签也。唯君尔虚空结愿结人缘。一人之力。有限者。如果逞一时之勇盲目猛冲。恐有难发生之时。时也命也。汝可悟之。叵逞勇矣。易言之。有人见我空自怀然佛慈指乐切莫轻谩。');
INSERT INTO `draw_lots` VALUES (80, '上签\n智远投军\n未宫\n直上仙岩要学仙　此知一旦帝王宣　\n青天日月常明照　心正声名四海传\n此卦贵人接引之象　凡事和合大吉也\n有始有终　莫向西东　心中用事　贵人重重\n　\n自身  吉利　\n求财  有利　\n交易  遂意　\n婚姻  双配　\n本签示之於**。之意为贵人性情之象也。凡百事遇贵人即化凶趋吉者。由诗意得知君尔直上高山去学化。岂知一旦帝王宣。即青天白日常明照。晴天无一片云。白日常照时。君之命运。正如当中。易言之。有始有终大问西中。心中用事贵人重重。');
INSERT INTO `draw_lots` VALUES (81, '上签\n风送滕王阁\n未宫\n梧桐叶落秋将暮　行客归程去似云　\n谢得天公高著力　顺风船载宝珍归\n此卦梧桐叶落之象　凡事先凶后吉也\n心中取事　天心从之　营谋用事　尽可施为\n　\n自身  许经　\n求财  遂意　\n交易  成　\n婚姻  和合\n本签也。从心望之之象也。凡事大吉利者。一叶如秋後。逐渐有机缘。行客之来势如飞奔。风送君尔之船。只要轻轻著力。尔船即将宝藏船舶推送回来。不必费力者。此者非人力之所逮。易言之。心中所望。天必从之。所谋用事尽可施者也。');
INSERT INTO `draw_lots` VALUES (82, '中签\n火烧葫芦谷\n未宫\n炎炎烈火焰连天　焰里还生一朵莲　\n到底得成终不害　依然生叶长根枝\n此卦火里生莲之象　凡事似险非险也\n虽然逢险　不损其身　营谋用事　皆遇贵人\n　\n自身  谨防　\n求财  劳力　\n交易  小人　\n婚姻  阻　\n本签者。如月初出之象。凡事举之时。得待时。来济时方吉者。君尔之今则是时运未济之时。今之不逢时叵逞强。欲图意外之财时。反而将失利者。宜控制之。不宜放任行之。汝必须待到十五良宵夜。月光瞑才可见。到清光。易言之。汝如是自足月初出直到圆时无有不吉者。');
INSERT INTO `draw_lots` VALUES (83, '中签\n李渊登位\n未宫\n譬若初三四五缺　半无半有未圆全　\n等待十五良宵夜　到处光明到处圆\n此卦月缺未圆之象　凡事守候忍耐也\n守旧待待时　如月初出　待等圆时　无有不吉\n　\n自身  夏秋吉　\n求财  谨守　\n交易  待时　\n婚姻  迟　\n本签者。如月初出之象。凡事举之时。得待时。来济时方吉者。君尔之今则是时运未济之时。今之不逢时叵逞强。欲图意外之财时。反而将失利者。宜控制之。不宜放任行之。汝必须待到十五良宵夜。月光瞑才可见。到清光。易言之。汝如是自足月初出直到圆时无有不吉者。');
INSERT INTO `draw_lots` VALUES (84, '下签\n庄子试妻\n未宫\n因名丧德如何事　切恐吉中变化凶　\n酒醉不知何处去　青松影里梦朦胧\n此卦寒鱼离水之象　凡事不可移动也\n寒鱼离水　美中不足　若问营谋　不如莫起\n此签六甲煞旺　诸事不利　禳灾保安\n本签者因名丧德者。因之。凡事劳费心力而无益者也。为了攫取一己之名利。丧其德行。受世人辱骂。指摘者何用。神灵诫之曰。切忌忙中变作凶。本为善意。惟己之言行中不知不觉中。将善心变为恶而导致凶。易言之。君之命也寒鱼离水美中不足若问营谋如何结局。');
INSERT INTO `draw_lots` VALUES (85, '中签\n韩文公遇雪\n申宫\n云　雾罩山前路　万物圆中月再圆　\n若得诗书沉梦醒　贵人指引步天台\n此卦春尽花开之象　凡事主后改变也\n老者用求　春残再开　欲求名利　晚遇横财\n　\n自身  谨慎　\n求财  著力　\n交易  平　\n婚姻  迟　\n本签是暮春百花盛开之时。凡百事求谋俱吉者也。沉滞已久之命运。於今逐渐入佳境。珍惜此时。把握本刻。立即动之。汝之运图将为尔辟坦途。亦即是万宝园中可再团。易言之。老者还来暮春风和欲求名利早晚遇财。');
INSERT INTO `draw_lots` VALUES (86, '上签\n商辂中三元\n申宫\n春来花发映阳台　万里车来进宝财　\n若得禹门三级浪　恰如平地一声雷\n此卦上朝见帝之象　凡事太吉大利也\n朝帝受职　如贫得宝　谋望从心　卦中第一\n此签从心所欲　诸事皆吉\n本签是帝朝受职之象。凡百事兴者遇贵则吉利者也。春来花发。是百花争妍斗艳之刻。万里舟行进宝来其声声之旺也。如跃过禹门三级浪。恰如平地一声雷响起者。易言之。帝朝受职如贪得宝望用从心签中第一耶。');
INSERT INTO `draw_lots` VALUES (87, '中签\n咬金探地穴\n申宫\n人行半岭日西山　竣岭崖岩未可安　\n仰望上天为护佑　此身犹在太平间\n此卦淘沙见金之象　凡事有贵人之兆也\n凿石见玉　淘沙见金　须要著力　只是劳心\n　\n自身  欠利　\n求财  劳心　\n交易  谨慎　\n婚姻  有阻　\n本签者。是淘沙见金之象也。凡百事劳心即有成之命运。目下居於日衔山之境。且前面正遇崇山峻岭。艰苦历程中。苦中不得不仰头祈求上苍垂护佑。己身犹在太虚之间。唯劳心可成之命。易言之。剖石见玉。淘沙见金。须用著力劳心可成者也。');
INSERT INTO `draw_lots` VALUES (88, '中签\n庞洪畏包公\n酉宫\n林为一虎在当门　须是有威不害人　\n分明说是无防事　忧恼迟疑恐惊心\n此卦林木虎有威之象　凡事虚惊少实也\n炉头点雪　似耳边风　可宜作福　后吉前凶\n　\n自身  口舌　\n求财  小人　\n交易  不利　\n婚姻  不合　\n本签为木虎虚惊之家。凡百事宜守待事方吉安。千万叵倚强凌弱。远望威容意不禁者。即使木虎不必畏惧。但己身如同入大江心。岌岌可危。必须防贪求不已。生祸福无不自求者。必慎之。易言之。炉头点雪耳边过风可宜作福前凶後吉也。');
INSERT INTO `draw_lots` VALUES (89, '上签\n大看瑶花\n酉宫\n出入营谋大吉昌　似玉无瑕石里藏　\n若得贵人来指引　斯时得宝喜风光\n此卦石藏珍宝之象　凡事称心大吉也\n如石藏玉　贵人指示得祗称心　欢怀得意\n　\n自身  康泰　\n求财  遂　\n交易  成　\n婚姻  成就　\n本签者玉藏石中之象。凡事称心大吉昌者也。灵签曰。出入营谋大吉昌。君今逢无瑕之玉藏石中。能获贵人指点。扶持。终能得宝。此时此刻当喜非常。令人雀跃者。惟称心时不可大意者。更不忘修德。积善。易言之。本签为如玉藏石贵人指出而得宝称心遂意大吉者。');
INSERT INTO `draw_lots` VALUES (90, '上签\n苇佩遇仙\n酉宫\n忽言一信向天飞　泰山宝贝满船归　\n若问路途成好事　前头仍有贵人推\n此卦功名成就之象　凡事宜进大吉也\n若问功名　前有贵人　更添喜气　财禄丰盈\n此签诸事佳吉　求之顺遂\n本签者功名成就之象。凡事进身大吉雀也。君尔之今连也。忽鞘一信天下鞘之时。宝贝船装满截归之时若问前程於神仙。君之今也。始终应得贵人提之刻。凡百事得真人。顺利推进之运。上上者。易言之。君汝之今。欲问功名贵人遇得更增福庆财禄进益者耶。');
INSERT INTO `draw_lots` VALUES (91, '中签\n三战吕布\n酉宫\n好展愁眉出众来　前途改变喜多财　\n一条大路如天阔　凡有施财尽畅怀\n此卦前途显达之象　凡事通泰大吉也\n一条大路　可向前行　心中用事　只可向前\n此签诸事如心　顺利吉昌\n本签为前程有坦途可行之象。凡事谋之行之立见吉利者也。一条坦途可向前行。心中用事不必瞻前顾後。勇往迈进事事可如意。顺利吉昌者。唯行在顶峰傲。视下界之际。勿忘今日之所由生。皆由贵人扶之者。易言之。必留个余地。以防向下坡之崎岖。');
INSERT INTO `draw_lots` VALUES (92, '上签\n蔡卿报恩\n酉宫\n自幼为商任设谋　财禄盈丰不用求　\n若是双身谋望事　秀才出去状元回\n此卦自小为商之象　凡事勤俭无忧也\n自小至大　无阻无碍　作意营谋　功名顺遂\n　\n自身  泰　\n求财  顺遂　\n交易  胜　\n婚姻  合　\n本签者。进身大吉之象也。凡百事兴时操心大利。灵诗示之云。经商得利称心怀。福禄面也。荣华倍获财。君汝如问谋望之面。神可告之君。必能一举状元衣锦还乡者。易言之。汝自幼小之年。自小至大无相无碍诸事遂古。遂望自在耶。');
INSERT INTO `draw_lots` VALUES (93, '中签\n高君保招亲\n戌宫\n鸾凤翔毛雨淋漓　当时却被雀儿欺　\n惊教一日云开远　依旧还君整羽衣\n此卦鸾凤被雨之象　凡事待时大利也\n小人日盛　君子莫为　只宜守己　待时施为\n自身  谨防　\n求财  阻　\n交易  待时　\n婚姻  迟滞　\n本签示之於**曰。未用君子之象。凡事先难。因谋事之敏。终获吉利者也。君汝之目下命。人在穷困之际。啻好屈已忍之。强欢言笑。千万叵急躁恼怒。斯时四面楚歌。皆陷阱也。易言之。小人正盛君子莫为暂时守己自有亨通之时也。');
INSERT INTO `draw_lots` VALUES (94, '下签\n伯牙访友\n戌宫\n君子莫体小人为　事若差池惹是非　\n琴鸣须用知音听　守常安静得依稀\n此卦要逢知己之象　凡事守常则吉也\n知音方许　闲事莫理　待得贵人　无不欢喜\n自身  小人　\n求财  待时　\n交易  谨慎　\n婚姻  宜迟　\n本签者。君尔未遇知音之象也。凡事耐性行之。为之则趋吉也。平素多信仰神佛扶之。能遇贵人之时。君即可争如定静得便宜耶。易言之。汝在功行圆满之刻。必能光大门户。知音行正百事莫理若人遇贵无价珍美耶。');
INSERT INTO `draw_lots` VALUES (95, '中签\n曹丕称帝\n戌宫\n志气功业在朝朝　今将酒色不胜饶　\n若见金鸡报君语　钱财福禄与君招\n此卦志气功名之象　凡事守常大吉也\n志气心动　守己未迟　金鸡报诺　无不欢喜\n自身  中平　\n求财  劳心　\n交易  早断　\n婚姻  有成　\n本签之曰功名待时之象。凡百事必就大利者耶。上上之签。百事皆有遂意之可能。繇於祖德之深。君尔又顺理而行。益加倍植。则天之报应。具有复泰之象。占此签之君慎守之。易言之。尔之今也事业功名守已待时金鸡终叫即时运亨通之刻耶。');
INSERT INTO `draw_lots` VALUES (96, '上签\n窦燕山积善\n戌宫\n巍峨宝塔不寻常　八面玲珑尽放光　\n劝君立志勤顶礼　作善苍天降福祥\n此卦福德现身之象　凡事大吉利也\n这些福份　众人皆有　不用心忙　福德前定　\n自身  许经　\n求财  正胜　\n交易  大吉　\n婚姻  好合　\n本签也。福德显现之象也。凡百事营谋可获利者耶。君之前。此宝塔为耸立云宵巍巍者。八面均放出异彩。啻要君志心勤顶礼。天龙。此吉祥之天兽。为君汝降天祥者。易言之。福田诸人皆现可用诚心。福德即到。');
INSERT INTO `draw_lots` VALUES (97, '中签\n六出祁山\n亥宫\n当风点烛空疏影　恍惚铺成镜里花　\n累被儿童求收拾　怎知只是幻浮槎\n此卦当风点烛之象　凡事虚名不利也\n富贵在天　贫穷是命　不用求谋　皆是前定　\n自身  谨慎　\n求财  得利　\n交易  慎重　\n婚姻  中平　\n本签也。虚名薄利之象。凡百事不得贪求者也。诗日：悦若铺地满地琼。岂知收拾总不成。如君之行动不紧速。将闹得无法收拾。遥言四播。到头来将陷入罗网中自拔不得。如此苦境只有几人知。易言之。君目下之运也。该知富贵在天。贫穷由命不用机谋。皆有分定者耶。');
INSERT INTO `draw_lots` VALUES (98, '下签\n吉平遇难\n亥宫\n出入求谋事宜迟　急恐忧愁惹是非　\n如鸟飞入罗网内　脱困能有几多时\n此卦守旧随缘之象　凡事不如意主凶也\n守旧随时　待贵人至　若问诸般　主事定迟\n自身  小人　\n求财  破　\n交易  损失　\n婚姻  不长　\n本签者。禽遭罗网之象。凡百事守旧可获安者。诗曰。经商出入事迟疑。也因此惹闲愁。不必要之愁争。听了是是非非。谣言四播。逢遇如此罗网苦境中。必须多修幅。积德方能脱离险境者耶。易言之，君之今也，禽遭罗网有理难分。随缘守旧遇贵乃成之命耶。');
INSERT INTO `draw_lots` VALUES (99, '下签\n陶三春挂帅\n亥宫\n勒马持鞭直过来　半有忧危半有灾　\n恰似遭火焚烧屋　天降时雨荡成灰\n此卦半忧半喜之象　凡事只宜行善也\n终身劳力　莫管是非　枷锁临时　怨尤自至　\n自身  守慎　\n求财  破　\n交易  阻　\n婚姻  刑克　\n本签示之於**者凶危有之象。凡事凶後吉耶。等闲骑马著马鞭来。半有忧危半有财。似火方烧头上屋。正受灾殃之刻。一场大雨来了之後。方可将灾厄洗清而去。目下虽事难成。劳心劳力之後。必有转安之时。易言之。君汝也。知如不知。不管是非临枷锁恩赦放归。');
INSERT INTO `draw_lots` VALUES (100, '下签\n三教谈道\n亥宫\n佛神灵变与君知　痴人说事转昏迷　\n老人求得灵签去　不如守旧待时来\n此卦守常勿动之象　凡事宜待时吉也\n完满灵签　尽报君加　信旧勿动　待等时至\n此是满签　诸事不利　大作福力　可保平安\n本签耶。无定之象。外虚少实者也。第一百首。是盈数。为全数之末。亦即言。它是前数之终。後数之始。易言之。黑暗将去。黎明到来之徵。表面上是没落之相。其实是通亨衢之意。唯集福之本。宜小心集之。及百析之未然营谋用事费力流连');

-- ----------------------------
-- Table structure for founder
-- ----------------------------
DROP TABLE IF EXISTS `founder`;
CREATE TABLE `founder`  (
  `QQ` int NOT NULL,
  PRIMARY KEY (`QQ`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '创始人列表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of founder
-- ----------------------------
INSERT INTO `founder` VALUES (1767927045);

-- ----------------------------
-- Table structure for group_933238308
-- ----------------------------
DROP TABLE IF EXISTS `group_933238308`;
CREATE TABLE `group_933238308`  (
  `QQ` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'QQ号',
  `Money` int NOT NULL DEFAULT 0 COMMENT '蜜桃币',
  `bank_money` int NOT NULL DEFAULT 0 COMMENT '银行金额',
  `sign_time` date NOT NULL DEFAULT '1970-01-01' COMMENT '签到时间',
  `even_sign` int NOT NULL DEFAULT 0 COMMENT '连续签到天数',
  `total_sign` int NOT NULL DEFAULT 0 COMMENT '总共签到天数',
  `vip_time` bigint NOT NULL DEFAULT 0 COMMENT '会员到期时间，时间戳',
  `treasure_data` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL COMMENT '宝物数据： ’ | ‘ 分开',
  `purview` int NOT NULL DEFAULT 0 COMMENT '权限 0：群员，1：管理员，2：主人，3：创始人',
  `interest_time` date NOT NULL DEFAULT '1970-01-01' COMMENT '领取利息时间',
  `say_num` int NULL DEFAULT 0 COMMENT '发言数量',
  PRIMARY KEY (`QQ`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of group_933238308
-- ----------------------------
INSERT INTO `group_933238308` VALUES ('1767927045', 9059296, 3723027, '2023-11-04', 140, 247, 2527174861, '已加入帮派|武林盟主称号|年|新|群二周年纪念卡片|对象|普通月饼|蛋黄月饼|蜜桃酱月饼|2021中秋纪念勋章', 3, '2023-08-11', 6617);

-- ----------------------------
-- Table structure for is_execute
-- ----------------------------
DROP TABLE IF EXISTS `is_execute`;
CREATE TABLE `is_execute`  (
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `value` tinyint NULL DEFAULT 0
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of is_execute
-- ----------------------------

-- ----------------------------
-- Table structure for kami
-- ----------------------------
DROP TABLE IF EXISTS `kami`;
CREATE TABLE `kami`  (
  `uuid` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '卡密uuid',
  `type` enum('vip','money') CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL DEFAULT 'money' COMMENT '卡密类型',
  `value` bigint NOT NULL DEFAULT 1000 COMMENT '额度',
  `count` int NOT NULL DEFAULT 1 COMMENT '剩余次数',
  `recharged_qq` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL COMMENT '已经充值过的QQ',
  PRIMARY KEY (`uuid`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of kami
-- ----------------------------
INSERT INTO `kami` VALUES ('群主真帅气', 'money', 1, 986, '');

-- ----------------------------
-- Table structure for lottery_draw
-- ----------------------------
DROP TABLE IF EXISTS `lottery_draw`;
CREATE TABLE `lottery_draw`  (
  `qq` varchar(12) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `title` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL,
  `content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL,
  `join_qq` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL,
  `win_num` int NULL DEFAULT NULL,
  `win_qq` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL,
  `is_open` int NULL DEFAULT 1
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of lottery_draw
-- ----------------------------
INSERT INTO `lottery_draw` VALUES ('1767927045', '测试', '标题', '1767927045|', 1, '1767927045', 0);

-- ----------------------------
-- Table structure for mc_data
-- ----------------------------
DROP TABLE IF EXISTS `mc_data`;
CREATE TABLE `mc_data`  (
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `version` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL,
  PRIMARY KEY (`name`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '存储Minecraft最新版本号' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of mc_data
-- ----------------------------
INSERT INTO `mc_data` VALUES ('fb_Beta', 'Minecraft Beta & Preview - 1.20.50.23');
INSERT INTO `mc_data` VALUES ('fb_open_group', '933238308|812057174');
INSERT INTO `mc_data` VALUES ('fb_Release', 'Minecraft - 1.20.41 (Bedrock)');
INSERT INTO `mc_data` VALUES ('version_list', '1.20.50.20 Preview|1.20.50.21 Preview|1.20.40|1.20.50.22 Preview');
INSERT INTO `mc_data` VALUES ('version_open_group', '933238308|812057174');

-- ----------------------------
-- Table structure for qq_group
-- ----------------------------
DROP TABLE IF EXISTS `qq_group`;
CREATE TABLE `qq_group`  (
  `qq_group` int NOT NULL COMMENT '群号',
  `is_open` tinyint NULL DEFAULT 0 COMMENT '是否开启本群',
  `is_init` tinyint NULL DEFAULT 1 COMMENT '是否初始化（创建表）',
  `add_message` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL COMMENT '加群消息',
  `leave_message` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL COMMENT '退群消息',
  `tell_time` tinyint NULL DEFAULT 0 COMMENT '报时开关',
  `join_mute` int NULL DEFAULT 0 COMMENT '加群禁言时长（秒）',
  `is_blacklist` tinyint NULL DEFAULT 0 COMMENT '是否启用黑名单',
  `buy_vip_money` int NULL DEFAULT 10000 COMMENT '购买会员需要的钱',
  `ban_word` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL COMMENT '违禁词用\"|\"分割',
  `is_lot` tinyint NULL DEFAULT 0 COMMENT '是否开启抽签',
  `time_out_kick` int NULL DEFAULT 0 COMMENT '加群多少时间不发言踢出，单位秒 (0：不踢出)',
  `auto_add_group_level` int NULL DEFAULT 0 COMMENT '自动同意加群等级',
  PRIMARY KEY (`qq_group`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = 'QQ群功能管理' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of qq_group
-- ----------------------------
INSERT INTO `qq_group` VALUES (933238308, 1, 1, '欢迎加入Minecraft资源群(′▽`??)\r\n我是本群的辣鸡机器人氺蜜桃ぎ y( ˙?. )\r\n氺蜜桃ぎ 温馨提醒您(*^ω^*)\r\n规则千万条\r\n群规第一条\r\n用语不规范\r\n离别两行泪\r\n特请注意凡是退群、被踢，都会被拉黑\r\n氺蜜桃ぎ 可不想在黑名单见到你哟 mua~\r\n发送“.菜单”获得菜单列表.\r\n发送Minecraft获取游戏下载地址\r\n进群半个小时不发言将被踢出群！！！', '退出了本群！', 1, 180, 0, 8000, 'vpn|肏|迷你世界|习近平|贱鸡|鸡巴|刷钻|教程地址|傻逼|返现|套现', 1, 1800, 0);

-- ----------------------------
-- Table structure for qq_list
-- ----------------------------
DROP TABLE IF EXISTS `qq_list`;
CREATE TABLE `qq_list`  (
  `QQ` bigint NOT NULL,
  `lot_time` date NOT NULL DEFAULT '1970-01-01',
  `tarot_time` date NULL DEFAULT NULL,
  PRIMARY KEY (`QQ`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of qq_list
-- ----------------------------

-- ----------------------------
-- Table structure for spy_screen
-- ----------------------------
DROP TABLE IF EXISTS `spy_screen`;
CREATE TABLE `spy_screen`  (
  `id` int NOT NULL,
  `time` bigint NULL DEFAULT NULL,
  `ip` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of spy_screen
-- ----------------------------

-- ----------------------------
-- Table structure for touch_fish
-- ----------------------------
DROP TABLE IF EXISTS `touch_fish`;
CREATE TABLE `touch_fish`  (
  `qq` bigint NULL DEFAULT NULL,
  `qq_group` bigint NULL DEFAULT NULL,
  `1_fish` int NULL DEFAULT 0 COMMENT '七彩大咸鱼',
  `2_fish` int NULL DEFAULT 0 COMMENT '金色咸鱼',
  `3_fish` int NULL DEFAULT 0 COMMENT '大咸鱼',
  `4_fish` int NULL DEFAULT 0 COMMENT '咸鱼'
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '摸鱼记录' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of touch_fish
-- ----------------------------

-- ----------------------------
-- Table structure for zuiyou
-- ----------------------------
DROP TABLE IF EXISTS `zuiyou`;
CREATE TABLE `zuiyou`  (
  `name` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL,
  `values` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of zuiyou
-- ----------------------------
INSERT INTO `zuiyou` VALUES ('审帖员', '1767927045|');
INSERT INTO `zuiyou` VALUES ('审帖中', '0');

SET FOREIGN_KEY_CHECKS = 1;
